Autodesk.Revit.DB.WallFoundation.WallId
Returns the host wall Id.
Since:
2016

Autodesk.Revit.DB.WallFoundation.FootingType
Retrieves an object that represents the type of the footing.
Remarks: The footing type can be used to access the multi layered structure of a footing.